//Задача 01-19: Система уравнений
//Найдите такие беззнаковые 32-битные числа x и y, которые удовлетворяют системе уравнений
//(a11 & x) ^ (a12 & y) = b1
//(a21 & x) ^ (a22 & y) = b2
//На вход программе подаются числа a11, a12, a21, a22, b1, b2. Все числа - 32-битовые беззнаковые.
//Если существуют числа x и y, удовлетворяющие данной системе уравнений, программа должна вывести слово Yes, 
//а в следующей строчке - числа x и y. Если же система не имеет решения, выведите единственное слово No

#include "stdio.h"

int main(void)
{
	unsigned int a11, a12, a21, a22, b1, b2, x = 0, y = 0;

	scanf("%u%u%u%u%u%u", &a11, &a12, &a21, &a22, &b1, &b2);

	unsigned int ans[64];

	for (int i = 0; i < 64; i++)
		ans[i] = 4;

	unsigned int inp, a11_, a12_, a21_, a22_, b1_, b2_, x_, y_;

	for (int bit = 0; a11 | a12 | a21 | a22 | b1 | b2; bit++)
	{
		a11_ = a11 & 1;
		a12_ = a12 & 1;
		a21_ = a21 & 1;
		a22_ = a22 & 1;
		b1_ = b1 & 1;
		b2_ = b2 & 1;

		inp = 0;
		inp |= a11_ << 5;
		inp |= a12_ << 4;
		inp |= a21_ << 3;
		inp |= a22_ << 2;
		inp |= b1_ << 1;
		inp |= b2_;

		x_ = 0;
		y_ = 0;

		if (ans[inp] == 4)
		{
			int flag = 0;

			for (unsigned int j = 0; j < 4; j++)
			{
				x_ = (j & 2) >> 1;
				y_ = j & 1;

				if
					(
						(((a11_ & x_) ^ (a12_ & y_)) == b1_) &&
						(((a21_ & x_) ^ (a22_ & y_)) == b2_)
						)
				{
					flag = 1;
					ans[inp] = j;
					break;
				}
			}

			if (!flag)
			{
				printf("No");
				return 0;
			}
		}

		x_ = (ans[inp] & 2) >> 1;
		y_ = ans[inp] & 1;

		x |= x_ << bit;
		y |= y_ << bit;

		a11 >>= 1;
		a12 >>= 1;
		a21 >>= 1;
		a22 >>= 1;
		b1 >>= 1;
		b2 >>= 1;
	}

	printf("Yes\n%u %u", x, y);

	return 0;
}
